[{
  "name": "First Meetup: Intro to Node.js",
  "rsvp_limit": 30,
  "status": "past",
  "local_date": "2012-09-26",
  "local_time": "18:00",
  "waitlist_count": 0,
  "yes_rsvp_count": 30,
  "venue": {
    "name": "UofM SmartPark - 2nd floor",
    "lat": "49.831744",
    "lon": "-97.1957465",
    "address_1": "1 Research Rd",
    "city": "Winnipeg",
    "country": "ca",
    "localized_country_name": "Canada",
    "zip": "R3T 6E3",
    "state": "mb"
  },
  "description": "<p>We decided to do our first about one of the hottest topics in the web development world, Node.js.</p><p>We will start with a quick introduction to Node.js and then go over a few uses of Node.js and when not to use it. We will then dive into a few popular frameworks and see what each is good for and which you should use for your projects.</p><p><strong>Note:</strong> the exact topics will be subject to change due to time and other considerations. If you have other ideas for talks, or want to tell us what we must cover contact us on twitter @winnipegjs (http://www.twitter.com/winnipegjs) </p><p>.Remeber to RSVP to the event if you are planning on attending. Hope to see you all there!</p><ul><li><a href=\"/slides/meetup-1-intro-to-node.pptx\">Slides</a></li><li><a href=\"/slides/meetup-1-intro-to-node.pptx\">Slides</a></li><li><a href=\"https://github.com/yagudaev/winnigram\">Source Code (github)</a></li><li><a href=\"http://youtu.be/Rqxx7R_m1aQ\">Video (only first part of talk)</a></li></ul>",
  "visibility": "public"
},
{
  "name": "Second Meetup: Test Driven Development",
  "rsvp_limit": 30,
  "status": "past",
  "local_date": "2012-10-30",
  "local_time": "18:00",
  "waitlist_count": 0,
  "yes_rsvp_count": 30,
  "venue": {
    "name": "UofM SmartPark - 2nd floor",
    "lat": "49.831744",
    "lon": "-97.1957465",
    "address_1": "1 Research Rd",
    "city": "Winnipeg",
    "country": "ca",
    "localized_country_name": "Canada",
    "zip": "R3T 6E3",
    "state": "mb"
  },
  "description": "<p>Test Driven Development is software development methodology based on \"test first\" approach.</p><p>That means that before even writing a line of code we need to write a test for it.</p><p>Benefits of applying TDD includes:</p><ul><li>Increase development confidence</li><li>Improve quality of the code and use quality as a driver</li><li>Regression testing at any point</li><li>Automatic documentation</li><li>Bring back the joy of coding!</li></ul><p>The idea seems fine for languages like C# however what about Javascript? Javascript is quite a popular language (if not the most) so, are we condemned to test the UI every time I want to test my JS code? Why can't we do TDD with it?</p><p>Of course we can! Join me on a session to discuss how to start with Jasmine, a JS library for testing in general, that provides great syntax to use TDD. I assure you your JS code will never be the same!</p><h2>About the Speaker</h2><p>Amir Barylko started his career in 1994 working for IBM as a senior developer while he was finishing his Masters degree in computer science. Since then he worked as team leader and architect for the past 15 years.</p><p>Having started with languages like C++ and Java he spent many years coding in C# and training other developers in topics such domain modeling, abstractions, patterns, automation, dependency injection, testing, etc. Being an incurable geek, always thirsty for knowledge, his passion for technology moved him towards Ruby on Rails a few years ago, becoming an advocate of RoR web development. Also following he's teaching passion he did his first RoR training a year ago, and recently a TDD training with great reviews. Amir is a rare combination of high technical skills, lots of experience in a wide range of platforms, exceptional presentation skills and great sense of humor. His presentations are always rich in content and fun to attend.</p><h2>What to Bring</h2><p>If you wish to follow along you should bring your laptop with you and make sure you install Node.js. We will be using it to run the unit-tests during the presentation.</p>",
  "visibility": "public"
},
{
  "name": "Third Meetup: Phonegap - Cross Platform Mobile Development",
  "rsvp_limit": 30,
  "status": "past",
  "local_date": "2012-11-21",
  "local_time": "18:00",
  "waitlist_count": 0,
  "yes_rsvp_count": 30,
  "venue": {
    "name": "UofM SmartPark - 2nd floor",
    "lat": "49.831744",
    "lon": "-97.1957465",
    "address_1": "1 Research Rd",
    "city": "Winnipeg",
    "country": "ca",
    "localized_country_name": "Canada",
    "zip": "R3T 6E3",
    "state": "mb"
  },
  "description": "<p>Phonegap is a platform that bridges the shortcomings of standard mobile web and native applications. It provides a standard API and tools to produce a compiled native application, while still using Javascript as our language of choice.</p><p>Mobile device usage has grown at an incredible pace, both in developed and developing countries. The opportunities within this mobile space are huge, however, the fast differences between the environment and languages for each platform introduces many challenges. Mobile Web applications provide us with most of the tools and Phonegap gets us the rest of the way.</p><p>We will first discuss Mobile Web, see how far its come and see a simple demonstration of what it can do. Then, we will move onto Phonegap, what problems it solves, how it can be extended and some caveats of the platform.</p><h2>About the Speaker</h2><p>Dan Slack (<a href=\"https://twitter.com/javaslack\">@javaslack</a>) has been working with Javascript for 8 years now. He currently works a small mobile-centric company, Niche Solutions, were he is working on mobile solutions for enterprise customers. He has both experince working on native level applications as well as using Phonegap. </p>",
  "visibility": "public"
},
{
  "name": "Fourth Meetup: Introduction to CoffeeScript",
  "rsvp_limit": 30,
  "status": "past",
  "local_date": "2013-02-20",
  "local_time": "18:00",
  "waitlist_count": 0,
  "yes_rsvp_count": 30,
  "venue": {
    "name": "UofM SmartPark - 2nd floor",
    "lat": "49.831744",
    "lon": "-97.1957465",
    "address_1": "1 Research Rd",
    "city": "Winnipeg",
    "country": "ca",
    "localized_country_name": "Canada",
    "zip": "R3T 6E3",
    "state": "mb"
  },
  "description": "<p>CoffeeScript is a small language that compiles to Javascript that aims to solve many of the short comings of javascript (the bad parts). It makes it easier to write less code that does more in a simple and elegant way.</p><p>Kevin Quiring will be talking about CoffeeScript and how his team at Winnipeg Transit is using it to help them solve real problems. Problems that would otherwise require nasty hacks if they were written in plain javascript. He will also touch base on the criticism around coffee and why you should use it in your next project.</p><h2>About the Speaker</h2><p>Kevin Quiring is a passionate Ruby on Rails developer currently working for Winnipeg Transit.</p>",
  "visibility": "public"
},
{
  "name": "Fifth Meetup: A New Vision",
  "rsvp_limit": 30,
  "status": "past",
  "local_date": "2014-05-12",
  "local_time": "19:00",
  "waitlist_count": 0,
  "yes_rsvp_count": 30,
  "venue": {
    "name": "Canadian Tire Data Centre",
    "lat": "49.8938502",
    "lon": "-97.1457697",
    "address_1": "355 Portage Ave",
    "city": "Winnipeg",
    "country": "ca",
    "localized_country_name": "Canada",
    "zip": "R3B 2C3",
    "state": "mb"
  },
  "description": "<p>Let's meetup again and bring this community back on track again. The JS related topic for this meetup is not yet determined and will be announced later. Since Canadian Tire established their new data centre and design studio in Winnipeg, they have been planning to help build a stronger User Groups community and decided to join Winnipeg.js. At this meetup, Adam Merrifield and Craig Haney from the Canadian Tire Innovations in Kitchener will talk about their vision for Winnipeg's developer community and Canadian Tire's new design studio. There will probably be one or two speakers at the event presenting some JS related topics. If anybody would like to present something that is JS related, please let us know. You can contact us on Twitter or via email. We hope to see everybody again at this event ... share our experiences, catch up and have simply fun hanging out. And, of course, food and beverages will be provided, as always. </p>",
  "visibility": "public"
},
{
  "name": "Fifth Meetup: A New Vision",
  "rsvp_limit": 30,
  "status": "past",
  "local_date": "2014-05-12",
  "local_time": "19:00",
  "waitlist_count": 0,
  "yes_rsvp_count": 30,
  "venue": {
    "name": "Canadian Tire Data Centre",
    "lat": "49.8938502",
    "lon": "-97.1457697",
    "address_1": "355 Portage Ave",
    "city": "Winnipeg",
    "country": "ca",
    "localized_country_name": "Canada",
    "zip": "R3B 2C3",
    "state": "mb"
  },
  "description": "<p>Let's meetup again and bring this community back on track again. The JS related topic for this meetup is not yet determined and will be announced later. Since Canadian Tire established their new data centre and design studio in Winnipeg, they have been planning to help build a stronger User Groups community and decided to join Winnipeg.js. At this meetup, Adam Merrifield and Craig Haney from the Canadian Tire Innovations in Kitchener will talk about their vision for Winnipeg's developer community and Canadian Tire's new design studio. There will probably be one or two speakers at the event presenting some JS related topics. If anybody would like to present something that is JS related, please let us know. You can contact us on Twitter or via email. We hope to see everybody again at this event ... share our experiences, catch up and have simply fun hanging out. And, of course, food and beverages will be provided, as always. </p>",
  "visibility": "public"
},
{
  "name": "Sixth Meetup: Microsoft <3 Javascript & Introduction to Angular and Breeze",
  "rsvp_limit": 30,
  "status": "past",
  "local_date": "2014-06-18",
  "local_time": "17:30",
  "waitlist_count": 0,
  "yes_rsvp_count": 30,
  "venue": {
    "name": "SkullSpace",
    "lat": "49.8960145",
    "lon": "-97.1466717",
    "address_1": "374 Donald St",
    "city": "Winnipeg",
    "country": "ca",
    "localized_country_name": "Canada",
    "zip": "R3B 2J2",
    "state": "mb"
  },
  "description": "<p>Of course, pizza and beverages will be provided, as always :-)</p><h2>Microsoft &lt;3 JavaScript</h2><p>Microsoft has been typically seen as this big, evil, restrictive, prescriptive company that is entirelyanti-open source. But oh how the times have changed! Microsoft has embraced open source JavaScript frameworksas part of their web stack, improved tooling support to better support JavaScript, and even made availablean object-oriented JavaScript library called TypeScript. In this session I'll walk you through the <em>new</em>Microsoft and show you how they're being good neighbors in the JavaScript community.</p><h3>About the Speaker</h3><p>D'Arcy Lussier is the Microsoft Practice Lead for Online Business Systems, a Winnipeg professional servicescompany. He brings over a decade of industry experience, specifically around Microsoft's web stack. Extremelyactive in the developer community, D'Arcy has been involved with technology user groups for a number of years,been awarded the Microsoft MVP award for ASP.NET for the last 8 years, started and ran the Winnipeg Code Camp,and has run the Prairie Developer Conference since 2010 across the Canadian prairies.</p><p>Blog: <a href=\"http://www.geekswithblogs.net/dlussier\">http://www.geekswithblogs.net/dlussier</a></p><p>Twitter: <a href=\"http://twitter.com/darcy_lussier\">darcy_lussier</a></p><p>Site: <a href=\"www.prairiedevcon.com\">www.prairiedevcon.com</a></p><h2>Introduction to Angular and Breeze</h2><p>Learn the fundamentals of AngularJS and watch as I build a sample application using AngularJS, Breeze.js,and Hot Towel all within Visual Studio!</p><h3>About the Speaker</h3><p>Mike Sigsworth is a consultant from Online Business Systems with over 7 years of experience working withASP.NET and C#. When he's not chasing around his two-year old son, he can be found in front of his laptopworking and/or playing with some manner of code, which has lately been a whole lot of Angular.</p>",
  "visibility": "public"
},
{
  "name": "Seventh Meetup: Creating, Automating and Testing",
  "rsvp_limit": 30,
  "status": "past",
  "local_date": "2014-09-22",
  "local_time": " 18:00",
  "waitlist_count": 0,
  "yes_rsvp_count": 30,
  "venue": {
    "name": "Canadian Tire Data Centre",
    "lat": "49.8938502",
    "lon": "-97.1457697",
    "address_1": "355 Portage Ave",
    "city": "Winnipeg",
    "country": "ca",
    "localized_country_name": "Canada",
    "zip": "R3B 2C3",
    "state": "mb"
  },
  "description": "<h2>Using the CreateJS Library, and working with the HTML 5 canvas</h2><p>TBA</p><h2>About the Speaker</h2><p>Travis Scott</p><h2>Automated garden management with Meteor and Raspberry Pi</h2><p>A cool project connecting Meteor to Raspberry pi's to automate and update gardens in realtime.</p><h2>About the Speaker</h2><p>Denny Scott</p><h2>It's a ghost town in there</h2><p>CasperJS is a browser automation and testing framework built on top of phantomjs.</p><p>Let's have a conversation about how and when we're using automated browser testing, and share lessons learned.</p><h2>About the Speaker</h2><p>Dan Bernardic enjoys collaboration and knowledge sharing. He is passionate about things like customer service and lowering the barrier to entry into the field of software development.</p><p>Dan enjoys writing code that resembles english and has been exploring venues for how to get more expressive and self-documenting programs for the past two years.</p><p>When not in front of a computer, he enjoys face painting kids and making them balloon animals when he is out and about with his daughter.<a href=\"http://en.gravatar.com/dbernar1\" title=\"Dan Bernardic's Gravatar Profile\">Online profile</a></p>",
  "visibility": "public"
},
{
  "name": "Monthly Meetup #1",
  "rsvp_limit": 60,
  "status": "past",
  "local_date": "2018-08-28",
  "local_time": "18:30",
  "waitlist_count": 0,
  "yes_rsvp_count": 26,
  "venue": {
    "name": "Launch Southside",
    "lat": 49.825355529785156,
    "lon": -97.16926574707031,
    "address_1": "200 - 1460 Chevrier Blvd",
    "city": "Winnipeg",
    "country": "ca",
    "localized_country_name": "Canada",
    "zip": "R3T 1Y6",
    "state": "mb"
  },
  "link": "https://www.meetup.com/winnipegjs/events/254008967/",
  "description": "<p>Winnipeg.js is back!</p> <p>As kick off and to celebrate we have a special event this month.</p> <p>First we want to thanks Launch (<a href=\"https://launch1460.ca\" class=\"linkified\">https://launch1460.ca</a>) for hosting this event and letting us use there space. The event will take place at 200 - 1460 Chevrier Blvd and starts at 6:30 PM (please be on time). During the event we'll have two talks and time to meet others.</p> <p>During this event we will be sharing:</p> <p>1 - Winnipeg.js Presentation - by Kleyson Prado &amp; Alexandre Martins<br/>In this talk the organizers will introduce us to Winnipeg.js: how it's going to work, how you can contribute and many other cool news to know what we can expect from this community.</p> <p>About Kleyson Prado:<br/>Kleyson is a Software Engineer from Brazil, with more than 10 years of experience developing successful projects. Focused on delivered business value and with strong technical knowledge in development and operations.<br/>Twitter: @kleysonprado</p> <p>About Alexandre Martins:<br/>Alexandre is a Software Engineer with 14 years programming experience in delivering enterprise software. Skilled in implementing complex software programs in Java with knowledge in back-end and front-end. Recently making a move to the JS world and is currently working at SkipTheDishes with React/React Native. He has 6 years of experience as professor of subjects like OOP, data-structures, artificial intelligence and distributed systems.<br/>Twitter: @xandecmartins</p> <p>2 - To React or not to React - by Nicol치s Isnardi<br/>Many times we hear that React is hard to learn. In his talk Nicol치s will show what React library is about and other parts of the React ecosystem that makes this a great thing to use in your next project.</p> <p>About Nicol치s Isnardi:<br/>Nicol치s is a passionate software developer from Buenos Aires, Argentina. Currently living in Winnipeg and works at SkipTheDishes. He has been organizing JavaScript meetups for more than 4 years and during 2017 had the chance to be part of the NodeConf Argentina organization team. Also last year, he had been awarded by Google as GDE for all his contributions.<br/>Twitter: @isnardi</p> <p>3- Lightning talk - New in Tech - by Michael Zelewski<br/>Michael will share his experience about learning JavaScript from scratch, be new in tech and changing his career path.</p> <p>About Michael Zelewski:<br/>Michael is stepping with passion into Software Development environment with curiosity to innovative technologies. Recently graduated from Node.js bootcamp course under ComIT (<a href=\"http://www.comit.org\" class=\"linkified\">http://www.comit.org</a>) &amp; SkipTheDishes initiative. Currently working as intern at SkipTheDishes. Excited for the opportunity to learn from professionals, working hard and pushing himself to achieve his goals.<br/>Twitter: @ZelewskiMichael</p> <p>As sometimes we might not have enough space to fit everyone we ask you that to drop your RSVP in case you know you won't be able to attend. This gives the opportunity for others to join.</p> <p>Thanks for reading and hope to see you next Tuesday 28th.<br/>Winnipeg.js Team</p> ",
  "visibility": "public"
},
{
  "name": "Monthly Meetup #2",
  "rsvp_limit": 60,
  "status": "past",
  "local_date": "2018-09-12",
  "local_time": "18:30",
  "waitlist_count": 0,
  "yes_rsvp_count": 52,
  "venue": {
    "name": "Forth Cafe",
    "lat": 49.89730453491211,
    "lon": -97.13719940185547,
    "address_1": "171 McDermot Ave",
    "city": "Winnipeg",
    "country": "ca",
    "localized_country_name": "Canada",
    "zip": "",
    "state": "MB"
  },
  "link": "https://www.meetup.com/winnipegjs/events/254445444/",
  "description": "<p>September is here and so it's a new Winnipeg.js event</p> <p>We want to thanks Forth (<a href=\"http://www.forth.ca\" class=\"linkified\">http://www.forth.ca</a>) for hosting this event and SkipTheDishes for the food and drinks (<a href=\"http://skipthedishes.com\" class=\"linkified\">http://skipthedishes.com</a>).</p> <p>The event will take place at 171 McDermot Ave and starts at 6:30 PM (please be on time). During the event we'll have two talks and time to meet others.</p> <p>This month we have 2 great speakers and talks!</p> <p>1 - Hello, React Native - by Justin Stanley<br/>Come meet React Native, React’s mobile child. Learn what it is, how it differs from React, and how easy it is to get started on your first mobile application using Expo.</p> <p>About Justin Stanley:<br/>Justin is a self-taught iOS developer who has a B. Commerce degree and learnt software development at Red River College. He works at SkipTheDishes on the Courier team developing the React Native apps and React website that food couriers use. In 2015 he created his own app BB Links on iOS in Swift, and earlier this year released a React Native version of the app for Android.</p> <p>Twitter: @jstheoriginal</p> <p>2 - Lightning talk<br/>Sign up at the event for a 5 minutes talk to show what you're working on, learning or what ever you would like to share.</p> <p>3- Automated Testing in JavaScript - by Michael Yagudaev<br/>Automated Testing is an important tool of ensuring the quality and durability of software. Until recently however, writing tests in JavaScript has been so painful very few would go through the trouble. Thanks to modern tools like Jest and Cypress, this is no longer true. In this talk we will talk about how to write tests, the thinking behind tests and what level of test is appropriate.</p> <p>About Michael Yagudaev<br/>Michael runs Nano 3 Labs, a digital product development studio specializing in React, React Native and Ruby on Rails development. He has been writing code professionally for close to a decade now. He loves contributing to Open Source, building beautiful products and snowboarding. A University of Manitoba CS graduate and one of the early co-founders of Winnipeg.js.</p> <p>Twitter: @yagudaev<br/>Github: @yagudaev</p> <p>As sometimes we might not have enough space to fit everyone we ask you that to drop your RSVP in case you know you won't be able to attend. This gives the opportunity for others to join.</p> <p>Thanks for reading and hope to see you next Wednesday.<br/>Winnipeg.js Team</p> ",
  "visibility": "public"
},
{
  "name": "Monthly Meetup #3",
  "rsvp_limit": 67,
  "status": "past",
  "local_date": "2018-10-23",
  "local_time": "18:30",
  "waitlist_count": 0,
  "yes_rsvp_count": 63,
  "venue": {
    "name": "Bold Commerce",
    "lat": 49.811607360839844,
    "lon": -97.18950653076172,
    "address_1": "50 Fultz Blvd",
    "city": "Winnipeg",
    "country": "ca",
    "localized_country_name": "Canada",
    "zip": "R2C 0A1",
    "state": "mb"
  },
  "link": "https://www.meetup.com/winnipegjs/events/255581123/",
  "description": "<p>October event Rocks!!</p> <p>We want to thanks Bold Commerce (<a href=\"https://boldcommerce.com\" class=\"linkified\">https://boldcommerce.com</a>) Twitter: @bold_commerce for hosting this event that will take place at 50 Fultz Blvd. and starts at 6:30 PM (please be on time). During the event we'll have two talks and time to meet others.</p> <p>This month we have 2 great speakers and talks!</p> <p>1 - Jest - by Leonardo Vasconcelos<br/>Over this this talk, Leonardo will explore some of the history and motivation that led to this testing framework creation. He will go over some examples and features that the framework supports. Also, a quick look over performance options for React apps.</p> <p>About Leonardo Vasconcelos:<br/>Leonardo is a React Developer at SkipTheDishes, Winnipeg. He likes to play soccer with friends, play the drums whenever he has the chance, read the Bible, and talk about many topics with interesting people. He has a Bachelor's Degree in Information Systems.</p> <p>Winnipegjs Slack user: @lddv<br/>Twitter user: @ldvasc<br/>Github: lddv</p> <p>2 - Lightning talk<br/>Sign up at the event for a 5 minutes talk to show what you're working on, learning or what ever you would like to share.</p> <p>3 - GraphQL vs REST API - by Himanshi Patel<br/>This is an introductory GraphQL talk to show how the query language works, the new way to think about API. For Instance, eliminating over/under fetching, reducing number of API calls and eliminate extra lines of code.</p> <p>Motivation</p> <p>Himanshi used to work for an accounting firm as a software developer. She worked on client and server side payroll logic, subsistence, PVL and Per Diem, etc. For all of it, She had to create lots of utils function to calculate CPP, EI and etc. As a result, maintenance and readability of code became expensive. As a solution, they replaced there api call with GraphQL.</p> <p>About Himanshi Patel<br/>Himanshi did 4 year university in computers in India, and 2 years in Toronto from Seneca College. She is working as software developer at skipTheDishes in customer post team.</p> <p>As there might be a lot of attendees going from downtown we can talk over slack to see the best way to get to Bold.</p> <p>As sometimes we might not have enough space to fit everyone we ask you that to drop your RSVP in case you know you won't be able to attend. This gives the opportunity for others to join.</p> <p>Thanks for reading and hope to see you next Wednesday.<br/>Winnipeg.js Team</p> ",
  "visibility": "public"
},
{
  "name": "Monthly Meetup #4",
  "rsvp_limit": 60,
  "status": "past",
  "local_date": "2018-11-27",
  "local_time": "18:30",
  "waitlist_count": 0,
  "yes_rsvp_count": 55,
  "venue": {
    "name": "iQmetrix Winnipeg Office",
    "lat": 49.893836975097656,
    "lon": -97.14397430419922,
    "address_1": "311 Portage Ave",
    "address_2": "Suite 200",
    "city": "Winnipeg",
    "country": "ca",
    "localized_country_name": "Canada",
    "zip": "R2C 0A1",
    "state": "mb"
  },
  "link": "https://www.meetup.com/winnipegjs/events/256574480/",
  "description": "<p>November comes with great news!!</p> <p>We want to thank iQmetrix (<a href=\"http://www.iqmetrix.com/\" class=\"linkified\">http://www.iqmetrix.com/</a>) Twitter: @iqmetrix for hosting this event that will take place at 311 Portage Ave - Suite 200 and starts at 6:30 PM (please be on time). During the event we'll have two talks and time to meet others.</p> <p>This month we have 2 great speakers and talks!</p> <p>1 - Storytelling on JS - by Axel Ali<br/>In this talk Axel will share his experience by building his JS game engine for visual novels and discussions about how to make frameworks for others to use.</p> <p>About Axel Ali:<br/>He's a Fullstack Software Developer, Worked in many parts of Latin America, Skills include machine learning and robotics</p> <p>Winnipegjs Slack user: Axel Ali<br/>Github: <a href=\"https://github.com/AxelAli\" class=\"linkified\">https://github.com/AxelAli</a><br/>Linkedin: <a href=\"https://linkedin.com/in/axel-ali\" class=\"linkified\">https://linkedin.com/in/axel-ali</a></p> <p>2 - Lightning talk<br/>Sign up at the event for a 5 minutes talk to show what you're working on, learning or what ever you would like to share.</p> <p>3 - Introduction to VueJS - by Charles Ouellet<br/>An introduction to Vue, a progressive framework for building user interfaces. Charles will show us the basics of Vue and how it can be easily integrated into an existing codebase. The talk will contain some live coding ;) Also, he will give us his takeaways from the VueConf (<a href=\"https://vuetoronto.com\" class=\"linkified\">https://vuetoronto.com</a>) that happened in Toronto on Nov 15-16.</p> <p>About Charles Ouellet<br/>Charles is from Quebec city but living in Winnipeg at the moment. He work at Snipcart (<a href=\"https://snipcart.com\" class=\"linkified\">https://snipcart.com</a>) as a developer and co-founder.</p> <p>Winnipegjs Slack user: Charles Ouellet<br/>Twitter user: @couellet<br/>Github: <a href=\"https://github.com/couellet\" class=\"linkified\">https://github.com/couellet</a></p> <p>As sometimes we might not have enough space to fit everyone we ask you that to drop your RSVP in case you know you won't be able to attend. This gives the opportunity for others to join.</p> <p>Thanks for reading and hope to see you next Tuesday.<br/>Winnipeg.js Team</p> ",
  "visibility": "public"
}
]